py32-rs/py32-data/svd/PY32F071Exx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Direct memory access</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA1_Channel1</name>
        <description>DMA1 Channel 1 Interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel2_3</name>
        <description>DMA1 Channel 2 and Channel 3 Interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel4_5_6_7</name>
        <description>DMA1 Channel 4, 5, 6, 7 Interrupts</description>
        <value>11</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <description>desc ISR</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>GIF1</name>
              <description>desc GIF1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF1</name>
              <description>desc TCIF1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF1</name>
              <description>desc HTIF1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF1</name>
              <description>desc TEIF1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF2</name>
              <description>desc GIF2</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF2</name>
              <description>desc TCIF2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF2</name>
              <description>desc HTIF2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF2</name>
              <description>desc TEIF2</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF3</name>
              <description>desc GIF3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF3</name>
              <description>desc TCIF3</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF3</name>
              <description>desc HTIF3</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF3</name>
              <description>desc TEIF3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF4</name>
              <description>desc GIF4</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF4</name>
              <description>desc TCIF4</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF4</name>
              <description>desc HTIF4</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF4</name>
              <description>desc TEIF4</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF5</name>
              <description>desc GIF5</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF5</name>
              <description>desc TCIF5</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF5</name>
              <description>desc HTIF5</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF5</name>
              <description>desc TEIF5</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF6</name>
              <description>desc GIF6</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF6</name>
              <description>desc TCIF6</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF6</name>
              <description>desc HTIF6</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF6</name>
              <description>desc TEIF6</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF7</name>
              <description>desc GIF7</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF7</name>
              <description>desc TCIF7</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF7</name>
              <description>desc HTIF7</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF7</name>
              <description>desc TEIF7</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <description>desc IFCR</description>
          <addressOffset>0x4</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>CGIF1</name>
              <description>desc CGIF1</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF1</name>
              <description>desc CTCIF1</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHTIF1</name>
              <description>desc CHTIF1</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF1</name>
              <description>desc CTEIF1</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CGIF2</name>
              <description>desc CGIF2</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF2</name>
              <description>desc CTCIF2</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHTIF2</name>
              <description>desc CHTIF2</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF2</name>
              <description>desc CTEIF2</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CGIF3</name>
              <description>desc CGIF3</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF3</name>
              <description>desc CTCIF3</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHTIF3</name>
              <description>desc CHTIF3</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF3</name>
              <description>desc CTEIF3</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CGIF4</name>
              <description>desc CGIF4</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF4</name>
              <description>desc CTCIF4</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHTIF4</name>
              <description>desc CHTIF4</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF4</name>
              <description>desc CTEIF4</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CGIF5</name>
              <description>desc CGIF5</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF5</name>
              <description>desc CTCIF5</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHTIF5</name>
              <description>desc CHTIF5</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF5</name>
              <description>desc CTEIF5</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CGIF6</name>
              <description>desc CGIF6</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF6</name>
              <description>desc CTCIF6</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHTIF6</name>
              <description>desc CHTIF6</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF6</name>
              <description>desc CTEIF6</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CGIF7</name>
              <description>desc CGIF7</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF7</name>
              <description>desc CTCIF7</description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHTIF7</name>
              <description>desc CHTIF7</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF7</name>
              <description>desc CTEIF7</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>desc HTIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>desc CIRC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>desc PINC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>desc MINC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>desc PSIZE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>desc MSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>desc PL</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>desc MEM2MEM</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR1</name>
          <description>desc CNDTR1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>desc NDT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR1</name>
          <description>desc CPAR1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>desc PA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR1</name>
          <description>desc CMAR1</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>desc MA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>desc CCR2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>desc HTIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>desc CIRC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>desc PINC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>desc MINC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>desc PSIZE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>desc MSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>desc PL</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>desc MEM2MEM</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR2</name>
          <description>desc CNDTR2</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>desc NDT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR2</name>
          <description>desc CPAR2</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>desc PA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR2</name>
          <description>desc CMAR2</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>desc MA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>desc CCR3</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>desc HTIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>desc CIRC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>desc PINC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>desc MINC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>desc PSIZE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>desc MSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>desc PL</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>desc MEM2MEM</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR3</name>
          <description>desc CNDTR3</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>desc NDT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR3</name>
          <description>desc CPAR3</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>desc PA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR3</name>
          <description>desc CMAR3</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>desc MA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
