py32-rs/py32-data/svd/PY32F071Exx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x30000</resetValue>
          <fields>
            <field>
              <name>BIAS_CR</name>
              <description>MR Bias current</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>BIAS_CR_SEL</name>
              <description>MR Bias current selection</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable backup domain write protection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage scaling range selection</description>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <description>Flash wait time after wakeup from the stop mode</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LPR</name>
              <description>Low-power run</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <description>HSI open time control</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x500</resetValue>
          <fields>
            <field>
              <name>PVDE</name>
              <description>Power voltage detector enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SRCSEL</name>
              <description>Power voltage detector volatage selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PVDT</name>
              <description>Power voltage detector threshold selection</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>FLTEN</name>
              <description>Digital filter enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_TIME</name>
              <description>Digital filter time configuration</description>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Power status register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PVDO</name>
              <description>PVD output</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and clock control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC and CTC global Interrupts</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Clock control register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>HSION</name>
              <description>HSI16 clock enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>HSI16 clock ready flag</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HSEON</name>
              <description>HSE clock enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSE clock ready flag</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>HSE crystal oscillator bypass</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CSSON</name>
              <description>Clock security system enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADC_DIV</name>
              <description>ADC Frequency Division</description>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>PLLON</name>
              <description>PLL enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>PLL clock ready flag</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <displayName>ICSCR</displayName>
          <description>Internal clock sources calibration register</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>HSI_TRIM</name>
              <description>HSI clock trimming</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>HSI_FS</name>
              <description>HSI frequency selection</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>LSI_TRIM</name>
              <description>LSI clock trimming</description>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>Clock configuration register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <description>System clock switch</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <description>System clock switch status</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HPRE</name>
              <description>AHB prescaler</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PPRE</name>
              <description>APB prescaler</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>MCOSEL</name>
              <description>Microcontroller clock output</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>MCOPRE</name>
              <description>Microcontroller clock output prescaler</description>
              <bitRange>[30:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>PLL configuration register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>PLL clock source selection</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PLLMUL</name>
              <description>PLLMUL</description>
              <bitRange>[3:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSCR</name>
          <displayName>ECSCR</displayName>
          <description>External clock source control register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>HSE_DRV</name>
              <description>HSE_DRV</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>HSE_STARTUP</name>
              <description>HSE_STARTUP</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>LSE_DRIVER</name>
              <description>LSE clock driver selection</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LSE_STARTUP</name>
              <description>LSE_STARTUP</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <displayName>CIER</displayName>
          <description>Clock interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI ready interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE ready interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI ready interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE ready interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLL ready interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <displayName>CIFR</displayName>
          <description>Clock interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI ready interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE ready interrupt flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI ready interrupt flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE ready interrupt flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>PLL ready interrupt flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSF</name>
              <description>HSE clock secure system interrupt flag</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSF</name>
              <description>LSE clock secure system interrupt flag</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <displayName>CICR</displayName>
          <description>Clock interrupt clear register</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <description>LSI ready interrupt clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>LSE ready interrupt clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>HSI ready interrupt clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>HSE ready interrupt clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYC</name>
              <description>PLL ready interrupt clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSC</name>
              <description>clock secure system interrupt flag clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSC</name>
              <description>LSE clock secure system interrupt flag clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPRSTR</name>
          <displayName>IOPRSTR</displayName>
          <description>GPIO reset register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <description>I/O port A reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBRST</name>
              <description>I/O port B reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCRST</name>
              <description>I/O port F reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIOFRST</name>
              <description>I/O port F reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <displayName>AHBRSTR</displayName>
          <description>AHB peripheral reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMARST</name>
              <description>DMA reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <description>CRC reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DIVRST</name>
              <description>DIV reset</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <displayName>APBRSTR1</displayName>
          <description>APB peripheral reset register 1</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TIM2RST</name>
              <description>TIM2 timer reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3RST</name>
              <description>TIM3 timer reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM6RST</name>
              <description>TIM6 timer reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7RST</name>
              <description>TIM7 timer reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCAPBRST</name>
              <description>RTCAPB reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WWDGRST</name>
              <description>WWDG reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2RST</name>
              <description>SPI2 reset</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USART2RST</name>
              <description>USART2 reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>USART3RST</name>
              <description>USART3 reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>USART4RST</name>
              <description>USART4 reset</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1RST</name>
              <description>I2C1 reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2RST</name>
              <description>I2C2 reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <description>USB reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CTCRST</name>
              <description>CTCRST</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <description>Power interface reset</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DACRST</name>
              <description>DACRST</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPARST</name>
              <description>OPARST</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LPTIMRST</name>
              <description>Low Power Timer reset</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <displayName>APBRSTR2</displayName>
          <description>APB peripheral reset register 2</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <description>SYSCFG reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCRST</name>
              <description>ADC reset</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DBGRST</name>
              <description>DBG reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <description>TIM1 reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <description>SPI1 reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1RST</name>
              <description>USART1 reset</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14RST</name>
              <description>TIM14 reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM15RST</name>
              <description>TIM15 reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TIM16RST</name>
              <description>TIM16 reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17RST</name>
              <description>TIM17 reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>COMP1RST</name>
              <description>COMP1 reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP2RST</name>
              <description>COMP2 reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP3RST</name>
              <description>COMP3 reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LCDRST</name>
              <description>LCD reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPENR</name>
          <displayName>IOPENR</displayName>
          <description>GPIO clock enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <description>I/O port A clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <description>I/O port B clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCEN</name>
              <description>I/O port C clock enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIOFEN</name>
              <description>I/O port F clock enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
